In [1]:
import numpy as np
import pandas as pd
dates = pd.date_range("20230101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [2]:
df[df["A"] > 0]

                   A         B         C         D
2023-01-01  0.414610 -0.860711  2.215234  0.495523
2023-01-04  0.762351  1.271691  1.618947  0.184410
2023-01-05  1.693939 -0.620749  0.560012 -1.600831
2023-01-06  0.358994 -0.365887 -0.414398  1.841146

In [3]:
df[df > 0]

                   A         B         C         D
2023-01-01  0.414610       NaN  2.215234  0.495523
2023-01-02       NaN       NaN  0.071486       NaN
2023-01-03       NaN  1.177364  0.407660  0.482485
2023-01-04  0.762351  1.271691  1.618947  0.184410
2023-01-05  1.693939       NaN  0.560012       NaN
2023-01-06  0.358994       NaN       NaN  1.841146

In [4]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2023-01-01  0.414610 -0.860711  2.215234  0.495523    one
2023-01-02 -0.271154 -2.413951  0.071486 -0.396200    one
2023-01-03 -0.227786  1.177364  0.407660  0.482485    two
2023-01-04  0.762351  1.271691  1.618947  0.184410  three
2023-01-05  1.693939 -0.620749  0.560012 -1.600831   four
2023-01-06  0.358994 -0.365887 -0.414398  1.841146  three

In [5]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2023-01-03 -0.227786  1.177364  0.407660  0.482485   two
2023-01-05  1.693939 -0.620749  0.560012 -1.600831  four